app/views/dash_boards/index.html.erb

SELECT "tutorials".* FROM "tutorials"
---
    <ol class="carousel-indicators">
     <% Tutorial.all.each_with_index do |tot,index| %>