app/controllers/tutorials_controller.rb

  def index
    @tutorials = Tutorial.all
---
SELECT "tutorials".* FROM "tutorials"

  def show
    @tutorial = Tutorial.find(params[:id])
---
SELECT "tutorials".* FROM "tutorials" WHERE "tutorials"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @tutorial = Tutorial.new(params[:tutorial])

    respond_to do |format|
      if @tutorial.save
---
INSERT INTO "tutorials" ("active", "category", "created_at", "description", "image_url", "paid", "title", "updated_at", "video_id", "video_url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"